# 发送队列检测间隔（毫秒）
FETCH_INTERVAL_S = 30

# 屏蔽词库更新间隔（秒）
GLOBAL_SHIELDS_UPDATE_INTERVAL_S = 3600

# 长间隔歌词检测阈值（秒）
LYRIC_EMPTY_LINE_THRESHOLD_S = 11

# B站直播弹幕颜色编号
BILI_COLORS={'16777215': '白色', '14893055': '紫色', '5566168': '松石绿', '5816798': '雨后蓝', '4546550': '星空蓝', 
            '9920249': '紫罗兰', '12802438': '梦境红', '16747553': '热力橙', '16774434': '香槟金', '16738408': '红色', 
            '6737151': '蓝色', '65532': '青色', '16772431': '黄色', '16766720': '盛典金', '4286945': '升腾蓝', 
            '8322816': '绿色', '16750592': '橙色', '16741274': '粉色'}

# B站直播弹幕位置编号
BILI_MODES={'1':'⋘', '4':'▁▁', '5':'▔▔'}

# 转义处理规则
HTML_TRANSFORM_RULES = {
    r"&apos;": "'",
    r"&quot;": "\"",
    r"&amp;": "＆",
    r"&nbsp;| ": " ",#注意"|"后的空格是&#160
}

# 压缩处理规则
COMPRESS_RULES = {
    r"[\.・]{2,}": "…",
    r"[!！]{2,}": "‼",
    r"[\?？]{2,}": "⁇",
    r"(。|，|\.|,)$": "",
    # 连续空格已在屏蔽字处理中进行了压缩，这里不再重复处理
}

# 文件名特殊字符处理规则
FILENAME_TRANSFORM_RULES = {
    "/":"／", "\\":"＼", "|":"｜", "*":"＊", "?":"？",
    ":":"：", "<":"＜", ">":"＞", "\"":"“",
}

# 正则表达式特殊字符处理规则
REGEX_CHAR_TRANSFORM_RULES = {
    "(":r"\(", ")":r"\)", "$":r"\$", "^":r"\^", "?":r"\?",
    "[":r"\[", "]":r"\]", "+":r"\+", "*":r"\*", ".":r"\.", 
    "{":r"\{", "}":r"\}", "|":r"\|", #"\\":r"\\", 
}

# 中文歌词补充处理规则
CN_LYRIC_PREPROCESS_RULES = {
    "妳":"你",
    "(?<![名巨显昭卓译编土原执])著(?![称有名作述于书籍])": "着",
    #"(?<![包缠妆])裏(?![着在住足尸])": "里", # 偶尔会遇到"裏"(li)错写成"裹"(guo)的情况
    r"[\(（].*?[译注]\s*?[:：].*?[\)）]": "",
}

# 可忽略的歌词规则
LYRIC_IGNORE_RULES=r"(?i)^[^0-9A-Za-z\u4e00-\u9fa5\u3040-\u31ff]{0,3}(终|完|undefined|[终終お]わ(る|り|った)|end|fin|music|[伴间]奏)[^0-9A-Za-z\u4e00-\u9fa5\u3040-\u31ff]{0,3}$|.(:|：|︰| - ).|©|不得翻唱"

# 恋口上默认预设
DEFAULT_CUSTOM_TEXT="<texts>\n<text title=\"古守恋口上\">\n我有些话想要对你说\n古守实在是太可爱了\n喜欢喜欢超喜欢 果然喜欢\n好不容易找到的吸血鬼\n肉肉来到世上的理由\n就是为了和古守相遇\n和肉肉一起共度一生\n世界上第一的家里蹲\n</text>\n</texts>"